Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 40,403,405
Trainable params: 40,403,405
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 40,403,405
Trainable params: 40,403,405
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 40,403,405
Trainable params: 40,403,405
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 40,403,405
Trainable params: 40,403,405
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 40,403,405
Trainable params: 40,403,405
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 40,403,405
Trainable params: 40,403,405
Non-trainable params: 0
_________________________________________________________________
