Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 1203      
=================================================================
Total params: 40,402,603
Trainable params: 40,402,603
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 1203      
=================================================================
Total params: 40,402,603
Trainable params: 40,402,603
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 1203      
=================================================================
Total params: 40,402,603
Trainable params: 40,402,603
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 1203      
=================================================================
Total params: 40,402,603
Trainable params: 40,402,603
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              40001000  
_________________________________________________________________
dense_2 (Dense)              (None, 400)               400400    
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 1203      
=================================================================
Total params: 40,402,603
Trainable params: 40,402,603
Non-trainable params: 0
_________________________________________________________________
